Revit 2027 API
DirectShapeReferenceOptions.SetExternalGeometryId Method
 Sets the ExternalGeometryId associated with the reference object. The ID must be non-empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectShapeReferenceOptions SetExternalGeometryId(
	ExternalGeometryId externalId
)
Public Function SetExternalGeometryId (
	externalId As ExternalGeometryId
) As DirectShapeReferenceOptions
public:
DirectShapeReferenceOptions^ SetExternalGeometryId(
	ExternalGeometryId^ externalId
)
member SetExternalGeometryId :
        externalId : ExternalGeometryId -> DirectShapeReferenceOptions
Parameters
externalId ExternalGeometryId
Return Value
DirectShapeReferenceOptions
Exceptions
Exception | Condition
ArgumentException |  externalId cannot be used as an ExternalGeometryId for a direct shape reference.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace